app/controllers/hero_powers_controller.rb

  def create
    hero_power = HeroPower.create!(hero_power_params)
---
INSERT INTO "hero_powers" ("strength", "power_id", "hero_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "Average"], ["power_id", 1], ["hero_id", 3], ["created_at", "2022-10-07 08:53:10.256217"], ["updated_at", "2022-10-07 08:53:10.256217"]]