app/controllers/heros_controller.rb

    def show
        #find
        hero = Hero.find(params[:id])
---
SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]