app/controllers/powers_controller.rb

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    power = Power.find(params[:id])

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "powers" SET "description" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["description", "Updated descriptions"], ["updated_at", "2022-10-07 07:00:38.491846"], ["id", 2]]
---
  def update
    #f ind
    power = Power.find(params[:id])
    # update
    power.update!(power_params)